TD3/Case/case0/0/T
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object T;
}

dimensions [ 0 0 0 1 0 0 0 ];

internalField uniform 301.9923740005116;

boundaryField
{
  floor
  {
    type wallHeatTransfer;
    Tinf uniform 305.2; 	// å¤é¨æ¸©åº¦
    alphaWall uniform 0.24; 	// ç±ä¼éä¿æ°
    value uniform 300; 	//type            zeroGradient;
  }
  ceiling
  {
    type wallHeatTransfer;
    Tinf uniform 303.2; 	// å¤é¨æ¸©åº¦
    alphaWall uniform 0.24; 	// ç±ä¼éä¿æ°
    value uniform 300; 	//type            zeroGradient;
  }
  nWall
  {
    type wallHeatTransfer;
    Tinf uniform 307.2;
    alphaWall uniform 0.36;
    value uniform 300; 	//type            zeroGradient;
  }
  sWall
  {
    type wallHeatTransfer;
    Tinf uniform 315.2;
    alphaWall uniform 0.36;
    value uniform 300;
  }
  glass1
  {
    type wallHeatTransfer;
    Tinf uniform 315.2; 	// å¤é¨æ¸©åº¦
    alphaWall uniform 4.3; 	// ç±ä¼éä¿æ°
    value uniform 300;
  }
  glass2
  {
    type wallHeatTransfer;
    Tinf uniform 307.2; 	// å¤é¨æ¸©åº¦
    alphaWall uniform 4.3; 	// ç±ä¼éä¿æ°
    value uniform 300;
  }
  sideWalls
  {
    type empty;
  }
  outlet
  {
    type zeroGradient;
  }
  inlet
  {
    type fixedValue;
    value uniform 293.15;
  }
  heatsource2
  {
    type fixedGradient;
    gradient uniform 0;
  }
  heatsource1
  {
    type fixedGradient;
    gradient uniform 0;
  }
  sun
  {
    type wallHeatTransfer;
    Tinf uniform 305.2; 	// å¤é¨æ¸©åº¦
    alphaWall uniform 0.24; 	// ç±ä¼éä¿æ°
    value uniform 300; 	/*
        type          compressible::turbulentHeatFluxTemperature;
        heatSource    flux;        // flux (ç±æµæ) ã¾ãã¯ power (ç±é)
        q             uniform 50.4; // ç±æµæ [W/m2] ã¾ãã¯ ç±é [W]
        kappa         fluidThermo;
        kappaName     none;
        value         uniform 300;
        */
  }
} 	// ************************************************************************* //

